<?php
    class ViewPrivacy{
        public static function initView($dir, $sess, $paths){
            ?>
                <body class="layout-fluid">
                    <link type="text/css" rel="stylesheet" href="<?php Nav::echoURL($dir, 'assets/css/lightgallery.min.css') ?>" /> 
                    <!-- Pre Loader -->
                    <?php Preloader::initPreloader($dir) ?>

                    <!-- Header Layout -->
                    <div class="mdk-header-layout js-mdk-header-layout">

                        <!-- Header -->
                        <?php Toolbar::initToolbar($dir, '', $sess) ?>
                        <!-- // END Header -->

                        <!-- Header Layout Content -->
                        <div class="mdk-header-layout__content" style="padding-top: 64px">
                      
                        <div data-push data-responsive-width="992px" class="mdk-drawer-layout js-mdk-drawer-layout">
                            <div class="mdk-drawer-layout__content page ">
                                <div class="container-fluid page__container">

                                        <!-- Navigation Paths -->
                                        <?php Breadcrumb::initBreadcrumb($dir, $paths) ?>
                                        <div class="media-body">
                                            <h1 class="h2">นโยบาลส่วนบุคคล</h1>
                                            <div>
<div>&nbsp;</div>

<div>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;สำนักงานพัฒนาธุรกรรมทางอิเล็กทรอนิกส์ (องค์การมหาชน) (&ldquo;สำนักงาน&rdquo;) ขอแนะนำให้ท่านทำความเข้าใจนโยบายส่วนบุคคล (privacy policy) นี้ เนื่องจาก นโยบายนี้อธิบายถึงวิธีการที่สำนักงานปฏิบัติต่อข้อมูลส่วนบุคคลของท่าน เช่น การเก็บรวบรวม การจัดเก็บรักษา การใช้ การเปิดเผย รวมถึงสิทธิต่าง ๆ ของท่าน เป็นต้น เพื่อให้ท่านได้รับทราบถึงนโยบายในการคุ้มครองข้อมูลส่วนบุคคลของสำนักงาน สำนักงานจึงประกาศนโยบายส่วนบุคคล ดังต่อไปนี้</div>

<div><br />
<strong>การเคารพสิทธิในความเป็นส่วนบุคคลของผู้ใช้บริการ</strong></div>

<div>๑. สำนักงานเคารพและให้ความสำคัญถึงสิทธิ ข้อมูลส่วนบุคคลและการคุ้มครองข้อมูลส่วนบุคคลของท่าน และ สำนักงานตระหนักดีว่า ท่านในฐานะผู้ใช้บริการธุรกรรมทางอิเล็กทรอนิกส์ของสำนักงาน หรือบริการอื่นใดของสำนักงานด้วยวิธีการทางอิเล็กทรอนิกส์ ย่อมมีความประสงค์ที่จะได้รับความมั่นคงปลอดภัยในการใช้บริการผ่านเว็บไซต์ของสำนักงาน&nbsp;</div>

<div>๒. ข้อมูลส่วนบุคคลของท่านที่สำนักงานได้รับมา เช่น ชื่อ อายุ ที่อยู่ หมายเลขโทรศัพท์ หมายเลขบัตรประชาชน ข้อมูลทางการเงิน เป็นต้น ซึ่งสามารถบ่งบอกตัวบุคคลของท่านได้ และเป็นข้อมูลส่วนบุคคลที่มีความสมบูรณ์ ถูกต้อง เป็นปัจจุบัน และมีคุณภาพ จะถูกนำไปใช้ให้เป็นไปตามวัตถุประสงค์การดำเนินงานของสำนักงานเท่านั้น และสำนักงานจะดำเนินมาตรการที่เข้มงวดในการรักษาความมั่นคงปลอดภัย ตลอดจนการป้องกันมิให้มีการนำข้อมูลส่วนบุคคลไปใช้โดยมิได้รับอนุญาตจากท่านก่อน</div>

<div><br />
<strong>การเก็บรวบรวมข้อมูลส่วนบุคคลอย่างจำกัด&nbsp;</strong></div>

<div>๑. ในการเก็บรวบรวมข้อมูล และเก็บรักษาข้อมูลส่วนบุคคลที่มีคุณภาพของท่าน สำนักงานจะใช้วิธีการที่ชอบด้วยกฎหมายและเป็นธรรมในการเก็บรวบรวมและจัดเก็บข้อมูล ตลอดจนเก็บรวบรวม และจัดเก็บข้อมูลส่วนบุคคลอย่างจำกัดเพียงเท่าที่จำเป็นแก่การให้บริการธุรกรรมทางอิเล็กทรอนิกส์ หรือบริการด้วยวิธีการทางอิเล็กทรอนิกส์อื่นใดภายใต้วัตถุประสงค์ของสำนักงานเท่านั้น&nbsp;</div>

<div>๒. สำนักงานจะขอความยินยอมจากท่านก่อนทำการเก็บรวบรวม เว้นแต่&nbsp;</div>

<div style="margin-left: 40px;">(๑)&nbsp; เป็นกรณีที่กฎหมายกำหนด</div>

<div style="margin-left: 40px;">(๒)&nbsp; เป็นไปเพื่อประโยชน์ของท่าน และการขอความยินยอมไม่อาจกระทำได้ในเวลานั้น</div>

<div style="margin-left: 40px;">(๓) เป็นไปเพื่อประโยชน์เกี่ยวกับชีวิต สุขภาพ หรือความปลอดภัยของท่านและผู้ใช้บริการท่านอื่น</div>

<div style="margin-left: 40px;">(๔) เพื่อประโยชน์แก่การสอบสวนของพนักงานสอบสวน หรือการพิจารณาพิพากษาคดีของศาล</div>

<div style="margin-left: 40px;">(๕) เพื่อประโยชน์ในการศึกษา วิจัย หรือการจัดทำสถิติ</div>

<div>๓. สำนักงานจะไม่จัดเก็บข้อมูลส่วนบุคคลของท่านซึ่งเกี่ยวกับลักษณะทางพันธุกรรม พฤติกรรมทางเพศ หรือข้อมูลที่อาจเป็นผลร้าย ทำให้เสียชื่อเสียง หรืออาจก่อให้เกิดความรู้สึกเกี่ยวกับการเลือกปฏิบัติโดยไม่เป็นธรรมหรือความไม่เท่าเทียมกันแก่บุคคลใด เว้นแต่</div>

<div style="margin-left: 40px;">(๑) ได้รับความยินยอมเป็นหนังสือจากท่าน</div>

<div style="margin-left: 40px;">(๒) เป็นกรณีที่กฎหมายกำหนด</div>

<div style="margin-left: 40px;">(๓) เป็นไปเพื่อประโยชน์ของท่าน และการขอความยินยอมไม่อาจกระทำได้ในเวลานั้น</div>

<div style="margin-left: 40px;">(๔) เป็นไปเพื่อประโยชน์เกี่ยวกับชีวิต สุขภาพ หรือความปลอดภัยของท่านและผู้ใช้บริการท่านอื่น</div>

<div style="margin-left: 40px;">(๕) เพื่อประโยชน์แก่การสอบสวนของพนักงานสอบสวน หรือการพิจารณาพิพากษาคดีของศาล</div>

<div style="margin-left: 40px;">(๖) เพื่อประโยชน์ในการศึกษา วิจัย หรือการจัดทำสถิติ</div>

<div style="margin-left: 40px;">๔. สำนักงานอาจรวบรวมข้อมูลส่วนบุคคลของท่านเข้ากับข้อมูลส่วนบุคคลของท่านที่ได้รับมาจากแหล่งอื่นเฉพาะในกรณีที่มีความจำเป็นและได้รับความยินยอมจากท่านเท่านั้น ทั้งนี้ เพื่อประโยชน์ในการปรับปรุงข้อมูลส่วนบุคคลของท่านให้เป็นปัจจุบัน และเพื่อปรับปรุงคุณภาพและประสิทธิภาพของการให้บริการของสำนักงานดียิ่งขึ้น</div>

<div><br />
<strong>วัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล&nbsp;</strong></div>

<div>๑. สำนักงานเก็บรวบรวมข้อมูลส่วนบุคคลของท่าน เพื่อการดำเนินงานของสำนักงาน การศึกษา วิจัย หรือการจัดทำสถิติซึ่งเป็นไปตามวัตถุประสงค์ของการดำเนินงานของสำนักงาน และเพื่อปรับปรุงคุณภาพของการให้บริการของสำนักงานด้วยวิธีการทางอิเล็กทรอนิกส์แก่ท่านให้มีประสิทธิภาพมากยิ่งขึ้น</div>

<div>๒. หากภายหลังมีการเปลี่ยนแปลงวัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล สำนักงานจะแจ้งให้ท่านทราบและขอความยินยอม และจัดให้มีบันทึกการแก้ไขเพิ่มเติมไว้เป็นหลักฐาน</div>

<div>๓. ในกรณีที่สำนักงานมีการเก็บรวบรวม จัดเก็บ ใช้และเปิดเผยข้อมูลส่วนบุคคล เพื่อดำเนินการอื่นนอกเหนือจากวัตถุประสงค์ตามที่ได้ระบุไว้ ท่านมีสิทธิที่ในความเป็นส่วนตัวของข้อมูลส่วนบุคคลของท่านในการเลือกว่า จะให้สำนักงานเก็บรวบรวม จัดเก็บ ใช้ เปิดเผยหรือไม่ให้เก็บรวบรวม จัดเก็บ ใช้ เปิดเผยข้อมูลส่วนบุคคลดังกล่าว</div>

<div>๔. เพื่อวัตถุประสงค์ในการวิเคราะห์และติดตามการใช้บริการทางเว็บไซต์ และวัตถุประสงค์ในการตรวจสอบย้อนหลังในกรณีที่เกิดปัญหาการใช้งาน สำนักงานจึงจัดเก็บบันทึกข้อมูลการเข้าออกเว็บไซต์ (Log Files) ของท่านโดยระบบอัตโนมัติ โดยจัดเก็บข้อมูลต่อไปนี้เป็นอย่างน้อย</div>

<div style="margin-left: 40px;">(๑) หมายเลขไอพี (IP Address)&nbsp;</div>

<div style="margin-left: 40px;">(๒) ประเภทของโปรแกรมบราวเซอร์ (Browser)&nbsp;</div>

<div>นอกจากนี้ สำนักงานยังได้ใช้บริการของหน่วยงานภายนอกที่มีการจัดเก็บบันทึกการเข้าออกระบบให้บริการทางเว็บไซต์ตามที่กฎหมายกำหนดด้วย สำหรับกรณีที่สำนักงานใช้บริการหน่วยงานภายนอกในการให้บริการเว็บไซต์</div>

<div>๕. สำนักงานจะไม่กระทำการใด ๆ แตกต่างจากที่ระบุในวัตถุประสงค์ของการเก็บรวบรวมข้อมูล เว้นแต่</div>

<div>(๑) ได้แจ้งวัตถุประสงค์ใหม่ให้ผู้ใช้บริการทราบ และได้รับความยินยอมจากผู้ใช้บริการ</div>

<div>(๒) เป็นกรณีที่กฎหมายกำหนด<br />
&nbsp;</div>

<div><strong>การนำข้อมูลส่วนบุคคลไปใช้อย่างจำกัด&nbsp;</strong></div>

<div>๑. สำนักงานจะใช้ เปิดเผยข้อมูลส่วนบุคคลของท่านได้ ต่อเมื่อได้รับความยินยอมจากท่านและจะต้องเป็นการใช้ตามวัตถุประสงค์ของสำนักงานเท่านั้น</div>

<div>๒. สำนักงานจะดูแลให้ผู้ปฏิบัติงานของสำนักงานมิให้เปิดเผย แสดง หรือทำให้ปรากฏในลักษณะอื่นใดซึ่งข้อมูลส่วนบุคคลของท่านนอกเหนือไปจากวัตถุประสงค์หรือต่อบุคคลภายนอก เว้นแต่</div>

<div style="margin-left: 40px;">(๑) เป็นกรณีที่กฎหมายกำหนด</div>

<div style="margin-left: 40px;">(๒) ได้รับความยินยอมจากท่าน</div>

<div style="margin-left: 40px;">(๓) เป็นไปเพื่อประโยชน์เกี่ยวกับชีวิต สุขภาพ หรือความปลอดภัยของท่านและผู้ใช้บริการอื่น</div>

<div style="margin-left: 40px;">(๔) เพื่อประโยชน์แก่การสอบสวนของพนักงานสอบสวน หรือการพิจารณาพิพากษาคดีของศาล</div>

<div style="margin-left: 40px;">(๕) เพื่อประโยชน์ในการศึกษา วิจัย หรือการจัดทำสถิติ</div>

<div>๓. ในบางกรณีสำนักงานอาจให้บุคคลหรือหน่วยงานอื่นเข้าถึงหรือใช้ข้อมูลส่วนบุคคลของท่านเท่าที่จำเป็น และเพื่อให้เป็นไปตามวัตถุประสงค์และอำนาจหน้าที่ของสำนักงาน ทั้งนี้ สำนักงานจะต้องได้รับความยินยอมจากท่านก่อน</div>

<div><br />
<strong>การรักษาความมั่นคงปลอดภัย&nbsp;</strong></div>

<div>๑. สำนักงานตระหนักถึงความสำคัญของการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลของท่าน สำนักงานจึงกำหนดให้มีมาตรการในการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลอย่างเหมาะสมและสอดคล้องกับการรักษาความลับของข้อมูลส่วนบุคคลเพื่อป้องกันการสูญหาย การเข้าถึง ทำลาย ใช้ แปลง แก้ไขหรือเปิดเผยข้อมูลส่วนบุคคลโดยไม่มีสิทธิหรือโดยไม่ชอบด้วยกฎหมาย โดยให้เป็นไปตามที่กำหนดในนโยบายและแนวปฏิบัติในการรักษาความมั่นคงปลอดภัยด้านเทคโนโลยีสารสนเทศของสำนักงาน</div>

<div><br />
<strong>การมีส่วนร่วมของเจ้าของข้อมูลส่วนบุคคล&nbsp;</strong></div>

<div>๑. ในกรณีที่ท่านประสงค์จะทราบข้อมูลส่วนบุคคลเกี่ยวกับตนเอง ท่านสามารถมีคำร้องขอตามหลักเกณฑ์และวิธีการที่สำนักงานกำหนด เมื่อสำนักงานได้รับคำร้องขอดังกล่าวแล้ว สำนักงานจะรีบดำเนินการแจ้งถึงความมีอยู่ หรือรายละเอียดของข้อมูลส่วนบุคคลดังกล่าวให้ท่านภายในระยะเวลาอันสมควร</div>

<div>๒. หากท่านเห็นว่า ข้อมูลส่วนบุคคลใดที่เกี่ยวกับตนไม่ถูกต้องตามที่เป็นจริง ท่านสามารถแจ้งสำนักงานเพื่อให้แก้ไข เปลี่ยนแปลง หรือลบข้อมูลส่วนบุคคลนั้นได้ ในการนี้ สำนักงานจะจัดทำบันทึกคำคัดค้านการจัดเก็บ ความถูกต้อง หรือการกระทำใด ๆ เกี่ยวกับข้อมูลส่วนบุคคลของท่านไว้เป็นหลักฐานด้วย</div>

<div>๓. ท่านมีสิทธิตรวจดูความมีอยู่ ลักษณะของข้อมูลส่วนบุคคล วัตถุประสงค์ของการนำข้อมูลไปใช้ และสถานที่ทำการของสำนักงาน นอกจากนี้ ยังมีสิทธิดังต่อไปนี้</div>

<div style="margin-left: 40px;">(๑) ขอสำเนา หรือขอสำเนารับรองถูกต้องเกี่ยวกับข้อมูลส่วนบุคคลของตน</div>

<div style="margin-left: 40px;">(๒) ขอแก้ไข หรือเปลี่ยนแปลงข้อมูลส่วนบุคคลของตนให้ถูกต้องสมบูรณ์</div>

<div style="margin-left: 40px;">(๓) ขอระงับการใช้ หรือเปิดเผยข้อมูลส่วนบุคคลที่เกี่ยวกับตน</div>

<div style="margin-left: 40px;">(๔) ขอให้ดำเนินการลบ หรือทำลายข้อมูลส่วนบุคคลที่เกี่ยวกับตน</div>

<div style="margin-left: 40px;">(๕) ขอให้เปิดเผยถึงการได้มาซึ่งข้อมูลส่วนบุคคลที่เกี่ยวกับตนในกรณีที่เป็นข้อมูลซึ่งผู้ใช้บริการไม่ได้ให้ความยินยอมในการรวบรวมหรือจัดเก็บ</div>

<div>อย่างไรก็ตาม สำนักงานอาจปฏิเสธสิทธิของท่านได้ในกรณีที่กฎหมายกำหนด หรือในกรณีที่ข้อมูลส่วนบุคคลของท่านถูกทำให้ไม่ปรากฏชื่อหรือสิ่งบอกลักษณะอันสามารถระบุตัวท่านได้อีก</div>

<div><br />
<strong>การเชื่อมโยงข้อมูลส่วนบุคคลกับบุคคลอื่นหรือหน่วยงานอื่น</strong></div>

<div>๑. สำนักงานอาจเชื่อมโยงข้อมูลส่วนบุคคลกับบุคคลหรือหน่วยงานอื่น สำนักงานจะแจ้งให้ท่านทราบก่อนที่จะทำการเชื่อมโยงข้อมูลส่วนบุคคล พร้อมทั้งขอความยินยอม โดยมีรายละเอียดต่อไปนี้เป็นอย่างน้อย</div>

<div style="margin-left: 40px;">(๑) บุคคลหรือหน่วยงานที่จะทำการเชื่อมโยงข้อมูลส่วนบุคคล</div>

<div style="margin-left: 40px;">(๒) วัตถุประสงค์ในการเชื่อมโยงข้อมูลส่วนบุคคล</div>

<div style="margin-left: 40px;">(๓) วิธีการในการเชื่อมโยงข้อมูลส่วนบุคคล</div>

<div style="margin-left: 40px;">(๔) ข้อมูลส่วนบุคคลที่จะทำการเชื่อมโยง</div>

<div style="margin-left: 40px;">(๕) บุคคลผู้มีสิทธิเข้าถึงข้อมูลส่วนบุคคล</div>

<div>๒. ในการเชื่อมโยงข้อมูลส่วนบุคคลกับบุคคลหรือหน่วยงานอื่น สำนักงานจะแสดงงชื่อผู้เก็บรวบรวม บุคคลผู้มีสิทธิในข้อมูลที่ได้มีการเก็บรวบรวมอย่างชัดเจน เพื่อให้ท่านได้รับทราบ นอกจากนี้ สำนักงานจะจัดทำบันทึกการเชื่อมโยงข้อมูลไว้เป็นหลักฐาน</div>

<div>๓. หากมีการเปลี่ยนแปลงการเชื่อมโยงข้อมูล สำนักงานจะแจ้งให้ท่านทราบถึงการเปลี่ยนแปลงดังกล่าว และขอความยินยอมก่อนการดำเนินการ</div>

                                         </div>
                                       
                                            </div>
                                        </div>
                                    </div>
                                </div>
                            
                                <?php //Sidemenu::initSideMenu($dir, $sess) ?>
                            </div>
                   
                    <?php Script::initScript($dir) ?>
                                                        
            
                                                        
                    
            <?php
        }
    }